ORProject_rails/app/controllers/api/v1/cases_controller.rb

SELECT "cases".* FROM "cases"
---
  def index
    @cases = Case.all

INSERT INTO "cases" ("id", "anesthesiologist", "procedure_name", "or_id", "created_at", "updated_at", "case_time", "surgeon_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    # byebug
    p case_params
    @case = Case.create(case_params)